Objetivo: Classificar se uma pessoa comprou ou não comprou um produto com base no salário ou na idade

In [1]:
# importa biblioteca pandas
import pandas as pd

In [2]:
df = pd.read_csv('Social_Network_Ads.csv',sep=',') # importa a base de dados

In [3]:
df.head() # exibe as primeiras linhas do Dataframe

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
# cria o dicionário
colunas = {'User ID': 'Usuario',
           'Gender': 'Genero',
           'Age': 'Idade','EstimatedSalary':'Salario Estimado',
           'Purchased': 'Comprou'}

In [6]:
df.rename(columns=colunas,inplace=True) # renomeia as colunas

In [7]:
df.head()

    Usuario  Genero  Idade  Salario Estimado  Comprou
0  15624510    Male     19             19000        0
1  15810944    Male     35             20000        0
2  15668575  Female     26             43000        0
3  15603246  Female     27             57000        0
4  15804002    Male     19             76000        0